Tekla.Structures.CatalogInternal.ShapeMetadataTypeEnum
Represents data type or measurement unit of the specific metadata
If this is updated, update ShapeMetadataType_e on the Core side

Tekla.Structures.CatalogInternal.ShapeMetadataTypeEnum.Text
Default value is text

Tekla.Structures.CatalogInternal.ShapeMetadataTypeEnum.Number
Number

Tekla.Structures.CatalogInternal.ShapeMetadataTypeEnum.Length
Unit of length

Tekla.Structures.CatalogInternal.ShapeMetadataTypeEnum.Area
Unit of area

Tekla.Structures.CatalogInternal.ShapeMetadataTypeEnum.Volume
Unit of volume

Tekla.Structures.CatalogInternal.ShapeMetadataTypeEnum.Weight
Unit of weight

Tekla.Structures.CatalogInternal.ShapeMetadataTypeEnum.DateTime
Date